app/Controllers/PinjamRuangan.php

    public function pinjamRuangan()
    {
        date_default_timezone_set('Asia/Jakarta');

        if ($this->request->getMethod() === 'post') {
            $data_ruangan_id = $this->request->getPost('ruangan_id');
            $dataArrRuangan = $this->Model_Ruangan->findAll();
            $dataArrJadwalRuangan = $this->Model_Jadwal->findAll();
---
SELECT *
FROM `ruangan`
SELECT *
FROM `jadwal`